tests/fixtures/lis2/todo/replacePersonRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <imsx_syncRequestHeaderInfo xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.imsglobal.org/services/lis/pms2p0/wsdl11/sync/imspms_v2p0">
      <imsx_version>V1.0</imsx_version>
      <imsx_messageIdentifier>2</imsx_messageIdentifier>
    </imsx_syncRequestHeaderInfo>
  </soapenv:Header>
  <soapenv:Body>
    <replacePersonRequest xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.imsglobal.org/services/lis/pms2p0/wsdl11/sync/imspms_v2p0">
      <sourcedId>G00030341</sourcedId>
      <personRecord>
        <sourcedGUID>
          <refAgentInstanceID>ILP</refAgentInstanceID>
          <sourcedId>G00030341</sourcedId>
        </sourcedGUID>
        <person>
          <formname>
            <formnameType>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/formatnmetypevocabularyv1p0</instanceVocabulary>
              <instanceValue>
                <language>en</language>
                <textString>Full</textString>
              </instanceValue>
            </formnameType>
            <formattedName>
              <language>en</language>
              <textString> Eric Andrew Merrill</textString>
            </formattedName>
          </formname>
          <name>
            <nameType>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/formatnmetypevocabularyv1p0</instanceVocabulary>
              <instanceValue>
                <language>en</language>
                <textString>Full</textString>
              </instanceValue>
            </nameType>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>First</textString>
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>Eric</textString>
              </instanceValue>
            </partName>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>Last</textString>
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>Merrill</textString>
              </instanceValue>
            </partName>
            <partName>
              <instanceIdentifier>
                <language>en</language>
                <textString>?</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/partnamevocabularyv1p0</instanceVocabulary>
              <instanceName>
                <language>en</language>
                <textString>Middle</textString>
              </instanceName>
              <instanceValue>
                <language>en</language>
                <textString>Andrew</textString>
              </instanceValue>
            </partName>
          </name>
          <contactinfo>
            <contactinfoType>
              <instanceIdentifier>
                <language>en</language>
                <textString>EmailPrimary</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/contactinfotypevocabularyv1p0</instanceVocabulary>
              <instanceValue>
                <language>en</language>
                <textString>EmailPrimary</textString>
              </instanceValue>
            </contactinfoType>
            <contactinfoValue>
              <language>en</language>
              <textString>test.merrill@oakland.edu</textString>
            </contactinfoValue>
          </contactinfo>
          <roles>
            <enterpriserolesType>
              <instanceIdentifier>
                <language>en</language>
                <textString>StudentInformationSystem</textString>
              </instanceIdentifier>
              <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/epriserolestypevocabularyv1p0</instanceVocabulary>
              <instanceValue>
                <language>en</language>
                <textString>StudentInformationSystem</textString>
              </instanceValue>
            </enterpriserolesType>
            <institutionRole>
              <institutionroletype>
                <instanceIdentifier>
                  <language>en</language>
                  <textString>Faculty</textString>
                </instanceIdentifier>
                <instanceVocabulary>http://www.imsglobal.org/lis/pmsv2p0/institutionroletypevocabularyv1p0</instanceVocabulary>
                <instanceValue>
                  <language>en</language>
                  <textString>Faculty</textString>
                </instanceValue>
              </institutionroletype>
              <primaryroletype>true</primaryroletype>
            </institutionRole>
            <userId>
              <userIdValue>
                <language>en</language>
                <textString>test.merrill</textString>
              </userIdValue>
              <userIdType>
                <language>en</language>
                <textString>Logon ID</textString>
              </userIdType>
              <password>
                <language>en</language>
                <textString>1c694edf-0d6e-455f-9286-c31748f8d358</textString>
              </password>
              <authenticationType>
                <language>en</language>
                <textString>ldap</textString>
              </authenticationType>
            </userId>
          </roles>
          <dataSource>Banner</dataSource>
          <extension>
            <extensionNameVocabulary>http://www.imsglobal.org/vdex/lis/pmsv2p0/extensionvocabularyv1p0</extensionNameVocabulary>
            <extensionTypeVocabulary>http://www.imsglobal.org/vdex/lis/pmsv2p0/extensionvocabularyv1p0</extensionTypeVocabulary>
            <extensionField>
              <fieldName>BannerID</fieldName>
              <fieldType>String</fieldType>
              <fieldValue>G00030341</fieldValue>
            </extensionField>
            <extensionField>
              <fieldName>SourcedId</fieldName>
              <fieldType>String</fieldType>
              <fieldValue>446161</fieldValue>
            </extensionField>
          </extension>
        </person>
      </personRecord>
    </replacePersonRequest>
  </soapenv:Body>
</soapenv:Envelope>